## How to display Dataframe in Jupyter style notebook

In [8]:
#prepare two dataframe
import pandas as pd
from IPython.display import display

list_of_lists = [[1, "Iron Man", "Robert Downey, Jr."],
                 [2, "The Incredible Hulk", "Edward Norton"],
                 [3, "Iron Man 2", "Robert Downey Jr."],
                 [4, "Thor", "Chris Hemsworth"]]

# Create the pandas DataFrame
df_a = pd.DataFrame(list_of_lists, columns=["FilmID", "FilmName","LeadingActor"])

list_of_lists = [[5, "Captain America: The First Avenger", "Chris Evans"],
                 [6, "The Avengers", "Robert Downey Jr."],
                 [7, "Iron Man 3", "Robert Downey Jr."],
                 [8, "Thor: The Dark World", "Chris Hemsworth"]]

df_b = pd.DataFrame(list_of_lists, columns=["FilmID", "FilmName","LeadingActor"])

display(df_a)
display(df_b)

   FilmID             FilmName        LeadingActor
0       1             Iron Man  Robert Downey, Jr.
1       2  The Incredible Hulk       Edward Norton
2       3           Iron Man 2   Robert Downey Jr.
3       4                 Thor     Chris Hemsworth

   FilmID                            FilmName       LeadingActor
0       5  Captain America: The First Avenger        Chris Evans
1       6                        The Avengers  Robert Downey Jr.
2       7                          Iron Man 3  Robert Downey Jr.
3       8                Thor: The Dark World    Chris Hemsworth

### Returns top/last rows.

In [9]:
#returns top
df_a.head(2)

   FilmID             FilmName        LeadingActor
0       1             Iron Man  Robert Downey, Jr.
1       2  The Incredible Hulk       Edward Norton

In [10]:
#returns last
df_a.tail(2)

   FilmID    FilmName       LeadingActor
2       3  Iron Man 2  Robert Downey Jr.
3       4        Thor    Chris Hemsworth

### Create function with the name of dataframe

In [12]:
#creating function to display

def show_df_a(n):
    print("\n df_a:\n")
    display(df_a.head(n))

def show_df_b(n):
    print("\n df_b:\n")
    display(df_b.head(n))

show_df_a(2)
show_df_b(2)

 df_a:

   FilmID             FilmName        LeadingActor
0       1             Iron Man  Robert Downey, Jr.
1       2  The Incredible Hulk       Edward Norton

 df_b:

   FilmID                            FilmName       LeadingActor
0       5  Captain America: The First Avenger        Chris Evans
1       6                        The Avengers  Robert Downey Jr.